const questions = [
    {
        question: "Как зовут Человека-паука в комиксах Marvel?",
        options: [
            "Питер Паркер",
            "Брюс Уэйн",
            "Кларк Кент",
            "Тони Старк"
        ],
        correctAnswer: 0
    },
    {
        question: "Какое насекомое укусило Питера Паркера, дав ему суперспособности?",
        options: [
            "Муравей",
            "Пчела",
            "Паук",
            "Скорпион"
        ],
        correctAnswer: 2
    },
    {
        question: "Кто является создателем Человека-паука?",
        options: [
            "Боб Кейн и Билл Фингер",
            "Стэн Ли и Стив Дитко",
            "Джек Кирби и Джо Саймон",
            "Джерри Сигел и Джо Шустер"
        ],
        correctAnswer: 1
    },
    {
        question: "В каком году впервые появился Человек-паук в комиксах?",
        options: [
            "1962",
            "1970",
            "1955",
            "1980"
        ],
        correctAnswer: 0
    },
    {
        question: "Где работал Питер Паркер фотографом?",
        options: [
            "New York Times",
            "Daily Planet",
            "Daily Bugle",
            "Washington Post"
        ],
        correctAnswer: 2
    },
    {
        question: "Какой суперзлодей убил Гвен Стейси, первую девушку Питера Паркера?",
        options: [
            "Веном",
            "Зеленый Гоблин",
            "Доктор Осьминог",
            "Электро"
        ],
        correctAnswer: 1
    },
    {
        question: "Какая фраза стала символом Человека-паука?",
        options: [
            "Я есть Грут",
            "Мстители, общий сбор!",
            "С большой силой приходит большая ответственность",
            "Я Бэтмен"
        ],
        correctAnswer: 2
    },
    {
        question: "Кто сыграл Человека-паука в первой трилогии фильмов?",
        options: [
            "Эндрю Гарфилд",
            "Том Холланд",
            "Тоби Магуайр",
            "Майлз Моралес"
        ],
        correctAnswer: 2
    },
    {
        question: "Какая способность у Человека-паука связана с опасностью?",
        options: [
            "Ночное видение",
            "Паучье чутье",
            "Телепатия",
            "Невидимость"
        ],
        correctAnswer: 1
    },
    {
        question: "Из чего Человек-паук создает свою паутину в комиксах?",
        options: [
            "Производит естественным путем как паук",
            "Использует специальные веб-шутеры",
            "Получает от Щ.И.Т.",
            "Покупает у Старк Индастриз"
        ],
        correctAnswer: 1
    }
]; 