const questions = [
    {
        id: 1,
        text: "Вспомните рецепт любимого домашнего блюда из детства жениха или невесты.",
        icon: "🍽️"
    },
    {
        id: 2,
        text: "Кем хотел(а) стать невеста или жених в детстве?",
        icon: "👨‍💼"
    },
    {
        id: 3,
        text: "Перечислите все кружки/секции, которые посещал жених или невеста в детстве.",
        icon: "🎭"
    },
    {
        id: 4,
        text: "Расскажите о вашем памятном путешествии из детства жениха или невесты.",
        icon: "✈️"
    },
    {
        id: 5,
        text: "Вспомните одно из самых ярких школьных выступлений жениха или невесты.",
        icon: "🎤"
    },
    {
        id: 6,
        text: "Что чаще всего просила купить в детстве невеста или жених?",
        icon: "🛍️"
    },
    {
        id: 7,
        text: "Какая у невесты/жениха была любимая игрушка в раннем детстве?",
        icon: "🧸"
    },
    {
        id: 8,
        text: "Какой мультфильм был любимым у невесты или жениха в детстве?",
        icon: "📺"
    },
    {
        id: 9,
        text: "Какой предмет в школе невесте или жениху давался легче всего?",
        icon: "📚"
    },
    {
        id: 10,
        text: "Назовите одну книгу, которую невеста или жених перечитывали в детстве (или которая произвела наибольшее впечатление).",
        icon: "📖"
    },
    {
        id: 11,
        text: "Какое занятие жених или невеста особенно любил(а) на летних каникулах?",
        icon: "☀️"
    },
    {
        id: 12,
        text: "Какой вид спорта жених или невеста любили в детстве больше всего?",
        icon: "⚽"
    },
    {
        id: 13,
        text: "В каких олимпиадах или конкурсах участвовали жених или невеста в школе? Какие вспомните победы?",
        icon: "🏆"
    },
    {
        id: 14,
        text: "Как зовут лучшего друга детства жениха или невесты?",
        icon: "👫"
    },
    {
        id: 15,
        text: "Расскажите о самом смешном происшествии на семейном празднике, связанном с невестой или женихом.",
        icon: "😄"
    },
    {
        id: 16,
        text: "Где жених или невеста провели свои самые запоминающиеся летние каникулы?",
        icon: "🏖️"
    },
    {
        id: 17,
        text: "Какую шалость в детстве совершала невеста или жених вместе с друзьями?",
        icon: "😈"
    },
    {
        id: 18,
        text: "Как зовут учителя, который оказал большое влияние на жениха или невесту?",
        icon: "👩‍🏫"
    },
    {
        id: 19,
        text: "Вспомните одно из наиболее ярких празднований детских дней рождения жениха или невесты? Как это было?",
        icon: "🎂"
    }
]; 